cf/Documents/ВозвратОтМОЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВозвратОтМОЛ</Name>
			<BasedOn>
				<xr:Item>Document.ВыдачаНаМОЛ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыМОЛ</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ВозвратОтМОЛ/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Валюта = Параметры.Валюта;
	МОЛ = Параметры.МОЛ;
	ТипЦен = Параметры.ТипЦен;
	СписокОстатки.Параметры.УстановитьЗначениеПараметра("МОЛ", МОЛ);
	Товары.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТоваровВХранилище));
	УдалитьИзВременногоХранилища(Параметры.АдресТоваровВХранилище); 
КонецПроцедуры

&НаКлиенте	
Процедура ПеренестиВДокумент()
	Модифицированность 	= Ложь;
	ЗакрытьФорму 		= Истина;
	ОповеститьОВыборе(ПоместитьТоварыВХранилище());
КонецПроцедуры	

&НаСервере
Функция ПоместитьТоварыВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(
					Товары.Выгрузить(), 
					УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура ПересчитатьЦенуПриИзменении(ТекСтрока)
	
	ТекСтрока.Цена = РаботаСНоменклатурой.ПолучитьЦену(	ТекСтрока.Номенклатура, ТипЦен, Валюта, ТекСтрока.Упаковка); 
   	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество;

КонецПроцедуры



//СОБЫТИЯ ФОРМЫ
&НаКлиенте
Процедура ТоварыСтрокаПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	ПересчитатьЦенуПриИзменении(ТД);
КонецПроцедуры
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	ТД.Сумма = ТД.Количество * ТД.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элементы.СписокОстатки.ТекущиеДанные;
	Строки = Товары.НайтиСтроки(Новый Структура("Номенклатура",ТД.Номенклатура));
	Если Строки.Количество() Тогда
		Строки[0].Количество = Строки[0].Количество + 1;
		Строки[0].Сумма = Строки[0].Цена * Строки[0].Количество;
	Иначе
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Количество = 1;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТД);
		ПересчитатьЦенуПриИзменении(НоваяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры
